Table of Contents
 Class ConcreteULSCheckResultTorsionEc2
Namespace
IdeaRS.OpenModel.Concrete.CheckResult
Assembly
IdeaRS.OpenModel.dll
ULS Check Torsion Ec2
public class ConcreteULSCheckResultTorsionEc2 : ConcreteULSCheckResultTorsion
Inheritance
object
ConcreteCheckResultBase
ConcreteULSCheckResultTorsion
ConcreteULSCheckResultTorsionEc2
Inherited Members
 ConcreteCheckResultBase.InternalFores
 ConcreteCheckResultBase.NonConformities
 ConcreteCheckResultBase.Result
 ConcreteCheckResultBase.CheckValue
 ConcreteCheckResultBase.LimitCheckValue
 ConcreteCheckResultBase.Check
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Ted
Design value of the applied torsional moment
public double Ted { get; set; }
Property Value
double
 Trd
decisive design torsional resistance
public double Trd { get; set; }
Property Value
double
 Trdc
torsional cracking moment
public double Trdc { get; set; }
Property Value
double
 Trdmax
design torsional resistance moment
public double Trdmax { get; set; }
Property Value
double
 Trds
design torsional resistance moment of shear reinforcement
public double Trds { get; set; }
Property Value
double
 Edit this page